---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexLine
source: html/0a29ebcf-95a7-a105-868b-81bcaa37a596.htm
---
# IndexLine Properties

The index of the line segment's first vertex.